      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEW-PROGRAM.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 SomeVariable PIC X VALUE SPACE.
       PROCEDURE DIVISION.
       Begin.
           DISPLAY "Hello World"
           STOP RUN.
       END PROGRAM NEW-PROGRAM.


